/*Задание 1
Напишите реализации функционального интерфейса Predicate, которые проверяют, является ли число положительным.
Если число положительное, то предикат должен возвращать true, в противном случае — false.

Реализуйте Predicate в двух вариантах:
через анонимный класс,
через лямбду.
Критерии проверки:
Predicate корректно реализован через анонимный класс.
Predicate корректно реализован через лямбда-выражение.

 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}